day_of_weeks = ['Понедельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье']
delays = ['Опоздание 0-15 минут', 'Опоздание 15-60 минут', 'Опоздание 60-180 минут', 'Опоздание 180+ минут']
months = ['Зима', 'Весна', 'Лето', 'Осень']
hours = ['00:00-01:00', '01:00-02:00', '02:00-03:00', '03:00-04:00', '04:00-05:00', '05:00-06:00', '06:00-07:00',
         '07:00-08:00', '08:00-09:00', '09:00-10:00', '10:00-11:00', '11:00-12:00', '12:00-13:00', '13:00-14:00',
         '14:00-15:00', '15:00-16:00', '16:00-17:00', '17:00-18:00', '18:00-19:00', '19:00-20:00', '20:00-21:00',
         '21:00-22:00', '22:00-23:00', '23:00-00:00']
day_parts = ['00:00-05:59','06:00-11:59','12:00-17:59','18:00-23:59']


def get_season(month):
    if month in [12, 1, 2]:
        return "Зима"
    elif month in [3, 4, 5]:
        return "Весна"
    elif month in [6, 7, 8]:
        return "Лето"
    else:
        return "Осень"


def get_hour_range(hour):
    return f"{hour:02}:00-{hour + 1:02}:00"




business_column_names = {
    "antecedents": "Антецедент",
    "consequents": "Консеквент",
    "antecedent support": "Поддержка антецедента",
    "consequent support": "Поддержка консеквента",
    "support": "Общая поддержка",
    "confidence": "Достоверность",
    "lift": "Подъем",
    "leverage": "Леверидж",
    "conviction": "Убеждение ",
    "zhangs_metric": "Метрика Чжана"
}
